{
  "name": "datajournalists/djspring17",
  "version": "0.1.4",
  "libraries": {
    "xv": "^1.1.25"
  },
  "title": "",
  "branch": "",
  "style": {
    "name": "Brutalist",
    "componentSet": {
      "nav": "nav/BasicNav",
      "header": "header/BasicHeader",
      "article": "article/MarkdownArticle",
      "footer": "footer/BasicFooter"
    },
    "fontFamily": "Consolas, \"Liberation Mono\", Menlo, Courier, monospace",
    "heading": {},
    "typeScale": [
      48,
      32,
      20,
      18,
      16,
      14,
      12
    ],
    "layout": {
      "maxWidth": 1024,
      "fluid": true
    },
    "colors": {
      "text": "#333",
      "background": "#fff",
      "primary": "#666",
      "secondary": "#888",
      "highlight": "#1f80ff",
      "muted": "#f6f6f6",
      "border": "#eee"
    }
  },
  "content": [
    {
      "component": "nav",
      "links": [
        {
          "href": "https://datajournalists.github.io/djspring17/",
          "text": "Home"
        },
        {
          "href": "https://github.com/datajournalists/djspring17",
          "text": "GitHub"
        }
      ]
    },
    {
      "component": "header",
      "heading": "djspring17",
      "subhead": "Data Journalism class. Spring 2017. CUNY Graduate School of Journalism",
      "children": [
        {
          "component": "ui/TweetButton",
          "text": "djspring17: Data Journalism class. Spring 2017. CUNY Graduate School of Journalism",
          "url": "https://datajournalists.github.io/djspring17/"
        },
        {
          "component": "ui/GithubButton",
          "user": "datajournalists",
          "repo": "djspring17"
        }
      ]
    },
    {
      "component": "article",
      "metadata": {
        "source": "github.readme"
      },
      "html": "<h1>Data Journalism. Spring 2017, CUNY J-School</h1>\n<p><strong>Semester/code:</strong> Spring 2017, JOUR 72312</p>\n<p><strong>Duration</strong> 15 Weeks. February 1 to May 24. No classes on February 15 and April 12.</p>\n<p><strong>Room/Meeting:</strong> Wednesday 5:30 pm to 8:20 pm. Room 430.</p>\n<p><strong>Index</strong></p>\n\n<ul>\n<li><a href=\"#data-journalism-spring-2017-cuny-j-school\">Data Journalism. Spring 2017, CUNY J-School</a><ul>\n<li><a href=\"#course-description\">Course Description</a></li>\n<li><a href=\"#objectives-and-outcomes\">Objectives and outcomes</a></li>\n<li><a href=\"#class-rules\">Class rules</a></li>\n<li><a href=\"#diversity\">Diversity</a></li>\n<li><a href=\"#instructors-and-office-hours\">Instructors and office hours</a></li>\n<li><a href=\"#assignments-and-due-dates\">Assignments and Due Dates</a><ul>\n<li><a href=\"#topic-beat-pre-reporting-and-pitch-of-4-story-ideas-5\">Topic beat pre-reporting and pitch of 4 story ideas (5%)</a></li>\n<li><a href=\"#class-participation-class-work-readings-15\">Class participation, class work, readings (15%)</a></li>\n<li><a href=\"#homework-data-exercises-15\">Homework data exercises (15%)</a></li>\n<li><a href=\"#story-projects\">Story projects</a></li>\n<li><a href=\"#deadlines\">Deadlines</a></li>\n<li><a href=\"#assignment-scale\">Assignment Scale</a></li>\n<li><a href=\"#assignment-values\">Assignment Values</a></li>\n</ul>\n</li>\n<li><a href=\"#grading-rubric\">Grading Rubric</a><ul>\n<li><a href=\"#for-all-assignments\">For all Assignments</a></li>\n<li><a href=\"#for-discussions\">For Discussions</a></li>\n<li><a href=\"#for-in-class-exercises\">For In-class Exercises</a></li>\n</ul>\n</li>\n<li><a href=\"#capstone-and-extra-credit\">Capstone and extra credit</a></li>\n<li><a href=\"#readings\">Readings</a></li>\n<li><a href=\"#class-schedule\">Class Schedule</a><ul>\n<li><a href=\"#week-1-feb-1\">Week 1 (Feb. 1)</a></li>\n<li><a href=\"#week-2-feb-8\">Week 2 (Feb. 8)</a></li>\n<li><a href=\"#no-class-monday-schedule-feb-15\">NO class, Monday schedule (Feb. 15)</a></li>\n<li><a href=\"#week-3-feb-22\">Week 3 (Feb, 22)</a></li>\n<li><a href=\"#week-4-march-1\">Week 4 (March 1)</a></li>\n<li><a href=\"#week-5-march-8\">Week 5 (March 8)</a></li>\n<li><a href=\"#week-6-march-15\">Week 6 (March 15)</a></li>\n<li><a href=\"#week-7-march-22\">Week 7 (March 22)</a></li>\n<li><a href=\"#week-8-march-29\">Week 8 (March 29)</a></li>\n<li><a href=\"#week-9-april-5\">Week 9 (April 5)</a></li>\n<li><a href=\"#springbreak-no-class-april-12\">SPRINGBREAK. NO CLASS. April 12.</a></li>\n<li><a href=\"#week-10-april-19\">Week 10 (April 19)</a></li>\n<li><a href=\"#week-11-april-26\">Week 11 (April 26)</a></li>\n<li><a href=\"#week-12-may-3\">Week 12 (May 3)</a></li>\n<li><a href=\"#week-13-may-10\">Week 13 (May 10)</a></li>\n<li><a href=\"#week-14-may-17\">Week 14 (May 17)</a></li>\n<li><a href=\"#week-15-may-24\">Week 15 (May 24)</a></li>\n</ul>\n</li>\n<li><a href=\"#coaches\">Coaches</a></li>\n</ul>\n</li>\n</ul>\n\n<h2>Course Description</h2>\n<p>Journalists live and get paid to find the truth, serve their communities and hold the powerful accountable. Today, fortunately, journalists have access to more data than ever before, as well as better tools to understand that data, expose the stories buried in the numbers, deal with troves of documents and combine this techniques with traditional serious reporting. From Phillip Meyer&#x2019;s exposes in Detroit using statistical and surveying techniques to the global story of the Panama Papers, Data Journalism has proven it&#x2019;s value as a powerful way to foster positive change in modern society.</p>\n<p>Data are everywhere. In public sources, like election results, budgets and census reports: semi public and private data sets like hidden company information; in cross referencing documents and databases to discover conflicts of interest and corruption, to social media like Facebook, Twitter updates, and image and video uploads. Journalists need to know how to find stories in data and shape them in compelling ways.</p>\n<p>In this hands-on course you will learn to gather, clean, structure and analyze data, use statistical methods to find relevant insights and bullet proof your work to produce two data-driven stories that may be of relevance to our community.</p>\n<p>While you learn to use different software and improve your data skills in our lab sessions, the driving theme of this course will be to do Journalism in the public interest.\nStudents will have individual lab assignments and will work in teams of two for the two semester stories, focused on original reporting about a public policy, an agency or government authority. Each team will pitch four stories and the instructors will choose two that they will report on during the entire semester. <strong>You will choose a Topic Beat. And you will OWN it</strong> <strong>for the entire semester.</strong> In the same way <a href=\"https://www.propublica.org/article/this-is-what-propublica-is-now-covering\">ProPublica defined its strategic reporting beats for the years to come</a>.</p>\n<h2>Objectives and outcomes</h2>\n<p>This three-credit course explores complex storytelling using data. Students will pitch, report, conceptualize and produce informative compelling data-driven pieces focused on current affairs, public policies or government agencies to hold power accountable. The course emphasizes:</p>\n<ul>\n<li><p>Learning basic descriptive and inferential statistical methods and concepts, the foundation of solid data reporting</p>\n</li>\n<li><p>Conceptualizing clear ways to illustrate trends as part of your analysis and stories</p>\n</li>\n<li><p>Data research, collection, organization and edition while maintaining data integrity</p>\n</li>\n<li><p>Understanding the development process for creating data stories</p>\n</li>\n<li><p>Applying strong traditional reporting techniques with data reporting in a weekly basis to plan and produce high quality data journalism</p>\n</li>\n<li><p>Understanding technologies available to work with data to create online, data-driven stories and to a lesser degree data-driven interactive stories</p>\n</li>\n<li><p>Using design basics, effective visual communication, and simple data visualization tools for analysis and creation of graphics</p>\n</li>\n<li><p>Critical evaluation of professional data stories (what makes a particular project successful?)</p>\n</li>\n<li><p>Seeking out innovative uses of data</p>\n</li>\n</ul>\n<h2>Class rules</h2>\n<p><strong>Attendance is mandatory.</strong> Data Journalism meets 15 times during the spring semester. It is important that you attend each class. If you&#x2019;re sick, please let us know via email, Slack or text. If you don&#x2019;t show up, you will hear from us. More than one excused absence will hurt your grade.</p>\n<p><strong>Communicate.</strong> If you have a problem or if you have difficulties, tell us right away, not after is too late. In journalism that&#x2019;s what we do. When we have a problem we immediately call our editor.</p>\n<p><strong>Punctuality matters.</strong> Be on time. It shows you are a professional journalist.</p>\n<p><strong>Be accurate.</strong> Always double check everything. Proofread. Ask at least two classmates to review your story before handing it in. When you make mistakes, it hurts your credibility and affects your grade.</p>\n<p><strong>Keep up with the news.</strong> Consuming information on a daily basis leads to a healthy diet of background, helps you connect the dots and discover story ideas to work on, If you care about a topic or your subject concentration you have to stay in top of the game.</p>\n<p><strong>Be a pro.</strong> Honesty, courtesy, curiosity and professionalism are the core values of a journalist. Behave like one because you are a journalist. When classmates are presenting or we have guests or we are working in teams don&#x2019;t multitask, focus.</p>\n<p><strong>Code of honor.</strong> This class follows the guidelines of the student handbook of our school. More so, in journalism plagiarism or falsification of data, sources and facts are serious crimes that can lead to failing this class. You may also be the subject of suspension, probation or expulsion, pending the decision of the School administration.</p>\n<h2>Diversity</h2>\n<p>It&apos;s critical that students learn to include a diverse set of voices in their stories, something that is often glossed over when finding stories in spreadsheets and online sources. You are encouraged and expected to look for stories about and voices from communities that are underrepresented. This also applies to our classroom. Diversity requires us all to discuss differences with respect and empathy, regarding race, gender, age, religion, gender, sexual preference, disability, language, origin or political beliefs.</p>\n<h2>Instructors and office hours</h2>\n<ul>\n<li><p><a href=\"https://www.journalism.cuny.edu/cunyj_profiles/paz-miguel-distinguished-lecturer-data-journalism-and-multimedia-storytelling/\">Miguel Paz</a> &#x2014; <a href=\"mailto:miguel.paz@journalism.cuny.edu\">miguel.paz@journalism.cuny.edu</a></p>\n<ul>\n<li>Office 421 A. Thursday 11:30 am - 1:00 p.m. and 2:30 pm - 5:30 pm. By appointment: <a href=\"https://calendly.com/miguelpaz/officehours\">https://calendly.com/miguelpaz/officehours</a>. Teams are encouraged to book a weekly time slot to work with with me in their projects. If you have conflicting schedule issues let me know and I will try to accommodate you.</li>\n</ul>\n</li>\n<li><p><a href=\"https://www.journalism.cuny.edu/cunyj_profiles/mcneill-ryan-investigative-reporting/\">Ryan McNeill</a> &#x2014; <a href=\"mailto:ryan.mcneill@journalism.cuny.edu\">ryan.mcneill@journalism.cuny.edu</a></p>\n<ul>\n<li>Meeting by appointment, via email.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Communication channels:</strong> <a href=\"https://miguelpaz.slack.com\">class Slack group</a> (#general, #leads, #recommended, direct messages for private questions). SMS for urgent stuff, email for longer things.</p>\n<h2>Assignments and Due Dates</h2>\n<p><em>Note:</em> For the first 3 weeks you will file your assignments via email to <a href=\"mailto:miguel.paz@journalism.cuny.edu\">miguel.paz@journalism.cuny.edu</a> and <a href=\"mailto:ryan.mcneill@journalism.cuny.edu\">ryan.mcneill@journalism.cuny.edu</a>.</p>\n<p><em>After Week 3 you will file your assignments using the Class Github repository. The link and instructions will be informed to you in Week 3.</em></p>\n<p>The class assignments are composed by: topic beat pre-reporting and pitch of 4 story ideas for 2 story projects (5%), class participation, class work and readings (15%), homework data exercises (15%), story project 1 (30%) and story project 2 (35%).</p>\n<h3>Topic beat pre-reporting and pitch of 4 story ideas (5%)</h3>\n<p>In the first class we will organize in teams of two people (5 teams). Each team will choose a topic beat and hand in a reporting memo via email about it before the 2nd class. Include as much relevant information you can gather about the topic. The idea is that you become as close to an expert as you can. In the 2nd class each team summarizes findings.</p>\n<p>In 3rd class each team pitches four story ideas. The Instructors will choose two story ideas per team. You will work on them for the entire semester and we will pick together which one you will do first and which second (by the time you hand in the 1st story we revisit the value of the 2nd story and see if it&#x2019;s still feasible or you can propose a new one).</p>\n<p><strong>Pitch requirements:</strong></p>\n<p>You must pitch 4 story ideas in 1 single document. Each story pitch should be 1 page long, 2 pages long max.</p>\n<p>For each story describe it in detail (1 page, 2 max. per story) by answering the following questions:</p>\n<ul>\n<li><p>Team byline and beat.</p>\n</li>\n<li><p>What is your story about? Tell us in 1 headline and 1 lead paragraph.</p>\n</li>\n<li><p>What is the single question your story tries to answer?</p>\n</li>\n<li><p>Why this story is relevant (&quot;So what?) and why now?</p>\n</li>\n<li><p>Why will this story resonate with our audience?</p>\n</li>\n<li><p>What else has been done on this topic? (Provide links) and how is your angle different or fresh?    </p>\n</li>\n<li><p>List in bullets the unique investigative findings your story will reveal</p>\n</li>\n<li><p>What are the potential main characters and scenes?    </p>\n</li>\n<li><p>What documents/data/audio have you already gathered?</p>\n</li>\n<li><p>List of human sources and if you have approached them already</p>\n</li>\n<li><p>Maximum/minimum.</p>\n<ul>\n<li><p>What is the maximum (best) story possible?</p>\n</li>\n<li><p>What&#x2019;s the minimum (fallback) story if your hypothesis doesn&#x2019;t prove out?</p>\n</li>\n</ul>\n</li>\n<li><p>Extra: Other questions that you can answer in a sentence: What other question is your story trying to answer? How will this story hold someone accountable? Does this story have potential to drive change?</p>\n</li>\n</ul>\n<p>Repeat the process for each story pitch. Keep it all in 1 document.</p>\n<p><strong>Deadline:</strong> Wednesday February 22 at 12 pm. You will file the pitches by sharing the link to your Pitches Google Doc via email to your Instructors. Make sure you share the document with permission to edit so we can add comments and suggest changes.</p>\n<h3>Class participation, class work, readings (15%)</h3>\n<p>Your participation and professionalism includes attending all classes, arriving on time, returning from breaks on time, being active in discussions about readings (see list of Readings), giving feedback to your peers, and participating in all in-class hands-on activities. Repeated absences or tardiness will result in a reduction in your grade.</p>\n<h3>Homework data exercises (15%)</h3>\n<p>There will be 10 individual homework data exercises that will be <a href=\"https://github.com/datajournalists/djspring17/blob/master/homework.md\">detailed the week before deadline, here</a>.</p>\n<ul>\n<li>Statistics exercise 1. Deadline: Wed. March 1, noon</li>\n<li>Statistics exercise 2. Deadline: Wed. March 8, noon</li>\n<li>SQL exercise 1. Deadline: Wed. March 15, noon</li>\n<li>SQL exercise 2. Deadline: Wed. March 22, noon</li>\n<li>Statistics exercise 3. Deadline: Wed. March 29, noon</li>\n<li>Statistics exercise 4. Deadline: Wed. April 5, noon</li>\n<li>Cleaning and extracting data. Deadline: Wed. April 19, noon</li>\n<li>Documents extraction exercise.  Deadline: Wed. April 26, noon</li>\n<li>Create charts or a simple graph database or network graph visualization with data of your Story 2. Deadline: Wed. May 3, noon</li>\n<li>GeoSpatial Analysis Exercise. Deadline: Wed. May 10, noon</li>\n</ul>\n<h3>Story projects</h3>\n<p>The main assignments for this course are two data journalism stories. For each story you will hand in reporting memos, drafts and final pieces. You will do this by working in your team stories repository in Github. If you get stuck, you can send it via email to the instructors.</p>\n<p><strong>Reporting memos:</strong> These are very simple documents addressed to your instructors. Their goal is to let them know what you did the past week, what problems you came across, what you need help with and what are your next reporting steps.</p>\n<p>Include:</p>\n<ul>\n<li>Story number and reporting memo number.</li>\n<li>Byline</li>\n<li>Date</li>\n<li>What you did this week<ul>\n<li>List of reporting activities done (sources contacted, data reviewed)</li>\n<li>Major findings</li>\n<li>Problems</li>\n<li>What you need help with</li>\n</ul>\n</li>\n<li>Next reporting steps</li>\n</ul>\n<p><strong>Draft and Final Stories:</strong> Your draft and final stories must include all the traditional elements of a story, a data folder and a methodology document.</p>\n<p>Elements of story:</p>\n<ul>\n<li>Headline</li>\n<li>Lead or nut graph</li>\n<li>Authors</li>\n<li>Text</li>\n<li>Any necessary credits, captions, etc.</li>\n<li>Data folder: Where you place the data you used, including clean data in spreadsheets, already normalized, sorted, manipulated.</li>\n<li>Methodology: Add in methodology.md file. Include list of human sources, links to every dataset and document you used, a data diary or data log detailing the steps you took while working with the data.</li>\n</ul>\n<p><strong>Story Project 1 (30%)</strong></p>\n<p>Breakdown:</p>\n<ul>\n<li>Reporting memo 1 (10 points)</li>\n<li>Reporting memo 2 (15 points)</li>\n<li>One draft story (25 points)</li>\n<li>Final story (50 points)</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Write a data-driven story.</li>\n<li>500 &#x2013; 800 words.</li>\n<li>Uses two or more datasets and at least 3 human sources that YOU have interviewed. This sources do not necessarily need to be directly referenced in the piece. If he or she is not referenced, you must explain in a note how this source helped you.</li>\n</ul>\n<p>Deadlines:</p>\n<ul>\n<li>Reporting memo 1, Week 4. Wed. March 1, noon</li>\n<li>Reporting memo 2, Week 5. Wed. March 8, noon</li>\n<li>Draft, Week 6. Wed. March 15, noon</li>\n<li>Story 1 final, Week 7. Wed. March 22, noon</li>\n</ul>\n<p><strong>Story Project 2 (35%)</strong></p>\n<p>Breakdown:</p>\n<ul>\n<li>Reporting memo 1 (5 points)</li>\n<li>Reporting memo 2 (10 points)</li>\n<li>Reporting memo 3 (10 points)</li>\n<li>Story draft 1 (12 points)</li>\n<li>Story draft 2 (13 points)</li>\n<li>Final story and web presentation (50 points)</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>A data-driven story that in its final version will be presented in a web page that will include visual or graphic elements that you propose. .</li>\n<li>700 &#x2013; 1000 words.</li>\n<li>Uses three or more datasets and at least 6 human sources that YOU have interviewed. This sources do not necessarily need to be directly referenced in the piece. If he or she is not referenced, you must explain in a note how this source helped you.</li>\n<li>Propose and author a web page for your story</li>\n</ul>\n<p>Deadlines:</p>\n<ul>\n<li>Reporting memo 1, Week 8. Wed. March 29, noon (or pitch new story 2 if your first idea does not work anymore)</li>\n<li>Reporting memo 2, Week 9. Wed. April 5, noon</li>\n<li>Reporting memo 3, Week 10. Wed. April 19, noon</li>\n<li>Draft 1, Week 11. Wed. April 26, noon</li>\n<li>Draft 2, Week 12. Wed. May 3, noon</li>\n<li>Final story and web presentation, Week 13. Wed. May 10, noon.</li>\n<li>Story 2 web page details,  Week 14, Wed. May 17, classwork</li>\n</ul>\n<h3>Deadlines</h3>\n<p>Deadlines matter. Please carefully note these rule: for every 24 hours that passes after a deadline in which you still have not turned in part of a project, an additional 10 percent deduction applies to it.</p>\n<p>There will be no extensions except in cases of medical emergency, family emergency, or zombie invasion. Make-up work will not be offered except in extenuating circumstances.</p>\n<h3>Assignment Scale</h3>\n<p>Final grades in the course correspond to the grading scale used in the CUNY Graduate School of Journalism. Here is the minimum percentage of each letter grade:</p>\n<ul>\n<li>97: A+  Stellar work. Ready to be published by a professional news organization with minimal changes.</li>\n<li>93: A Excellent work. It is ready to be published professionally with some changes.</li>\n<li>90: A- Good quality work, although it needs a slightly more significant revision to be able to be published.</li>\n<li>87: B+ Solid work that shows some deficiencies that need to be solved.</li>\n<li>83: B Meets certain requirements, but lacks several important elements.</li>\n<li>80: B- Below average and needs strong overall improvements.</li>\n<li>77: C+ Poor job. It presents many problems of structure, reporting and storytelling</li>\n<li>73: C Almost unacceptable because of major overall problems.</li>\n<li>70: C- Unacceptable. Does not meet the minimum requirements of a graduate level journalism project.</li>\n<li>Anything below a 70 is an F. Work has failed at every level. There is no D in CUNY&#x2019;s grading scale.</li>\n</ul>\n<h3>Assignment Values</h3>\n<p>Each assignment represents a percentage of your final grade and has points that adds up to 100 points, which equals the highest score for the assignment. The points you earn, for the different elements of the assignment, directly results in your assignment grade.</p>\n<p>Example: Story project 1 is 30% of your final grade. On a point scale your reporting memo 1 is 10 points, the reporting memo 2 is 15 points, your story draft is 25 points and your final story is 50 points. That&#x2019;s a total of 100 points. If you get 97 to 100 points in total you will have an A+ for that assignment. To determine your assignment grade, simply add up all the points you have earned for each sub-assignment.</p>\n<table>\n  <tr>\n    <td>Assignment and percentage of final grade</td>\n    <td>Assignment units breakdown</td>\n    <td>Points</td>\n  </tr>\n  <tr>\n    <td>Topic beat pre-reporting and pitch of 4 story ideas for 2 story projects (5%)</td>\n    <td>Pre-reporting memo, written pitch of 4 story ideas</td>\n    <td>100</td>\n  </tr>\n  <tr>\n    <td>Class participation, class work and readings (15%)</td>\n    <td>Engaging in class and reading debates, asking questions, giving feedback to your peers, doing class exercises</td>\n    <td>100</td>\n  </tr>\n  <tr>\n    <td>Homework data exercises (15%)</td>\n    <td>10 data exercises.<br>- Statistics exercise 1\n- Statistics exercise 2\n- SQL exercise 1\n- SQL exercise 2\n- Statistics exercise 3\n- Statistics exercise 4\n- Cleaning and extracting data\n- Documents extraction exercise\n- Create charts or a simple graph database or network graph visualization with data of your Story 2\n- GeoSpatial Analysis Exercise </td>\n    <td>10 points for each completed  exercise.\n5 points for incomplete exercise.\n\n0 points if you don&#x2019;t hand it in.</td>\n  </tr>\n  <tr>\n    <td>Story project 1 (30%).\n</td>\n    <td>Story 1: Reporting memo 1 </td>\n    <td>10 </td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 1: Reporting memo 2 </td>\n    <td>15</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 1: Draft of story</td>\n    <td>25</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 1: Final story</td>\n    <td>50</td>\n  </tr>\n  <tr>\n    <td>\nStory project 2 (35%)</td>\n    <td>Story 2: Reporting memo 1</td>\n    <td>5</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 2: Reporting memo 2 </td>\n    <td>10</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 2: Reporting memo 3 </td>\n    <td>10</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 2: Story draft 1 </td>\n    <td>12</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 2: Story draft 2 </td>\n    <td>13</td>\n  </tr>\n  <tr>\n    <td></td>\n    <td>Story 2: Final story and web presentation </td>\n    <td>50</td>\n  </tr>\n</table>\n\n\n<h2>Grading Rubric</h2>\n<h3>For all Assignments</h3>\n<p>In assessing students&apos; work, the instructor will focus on the following factors applicable to all assignments (specific criteria for each assignment will be detailed later):</p>\n<ul>\n<li><p>Process: Were the drafts iterated and improved based on faculty feedback?</p>\n</li>\n<li><p>Quality and Shine: Is it executed with skill and subtlety, and has it been edited well and polished?</p>\n</li>\n<li><p>Organization and Presentation: Is it presented clearly and in a professional manner suitable for an audience?</p>\n</li>\n<li><p>Effort and Application: Has the work been prepared with careful thought and attention to detail, and does it take appropriate advantage of the relevant tools?</p>\n</li>\n<li><p>Punctuality and Completeness: Is it on time and complete, and does it fulfill the assignment?</p>\n</li>\n</ul>\n<h3>For Discussions</h3>\n<ul>\n<li><p>Preparedness: Has the student completed the work necessary in preparation for the discussion (viewing assigned video, completing assigned reading or tutorial)?</p>\n</li>\n<li><p>Participation: Was the student engaged in the discussion (both paying attention and participating)?</p>\n</li>\n</ul>\n<h3>For In-class Exercises</h3>\n<ul>\n<li><p>Effort: Did the student try to complete the exercise to better understand the lesson at hand?</p>\n</li>\n<li><p>Participation: If the exercise involves collaboration, did the student contribute?</p>\n</li>\n</ul>\n<h2>Capstone and extra credit</h2>\n<p><strong>Capstone:</strong> Students who wish to incorporate material from the class into a capstone project may be able to make special arrangements.</p>\n<p><strong>Extra credit:</strong> One of the instructors (Miguel) maintains a Medium publication called <a href=\"https://medium.com/notes-from-the-classroom\">Notes from the Classroom</a>, where he and interested students write about tools, lessons, short tutorials and class work. If you write one or more posts about how you used data, specific tools and methodologies to produce one of your class stories you get extra credit. This extra credit will increase by 10% to 20% your class participation, class work and readings grade, depending on the quality and detail of the post. If you and your team members write a post, you must tell me what each one did in the project and in the written post.</p>\n<h2>Readings</h2>\n<p>Students will read selected chapters of the following books (available at the Research Center for this course).</p>\n<ul>\n<li><p>&quot;Computer-Assisted Reporting: A practical guide&quot;, 4th Edition. By Brant Houston.</p>\n</li>\n<li><p>&quot;Numbers in the Newsroom: Using math and statistics in News&quot;, 2nd Edition. By Sarah Cohen.</p>\n</li>\n<li><p>&quot;The investigative reporter&apos;s handbook: a guide to documents, databases, and techniques&quot;. 4th Edition. Edited by Brant Houston et al.</p>\n</li>\n<li><p>&quot;Precision Journalism: a Reporter&#x2019;s Introduction to Social Science Methods&quot;, 4th Edition. By Philip Meyer.</p>\n</li>\n<li><p>&quot;The Functional Art: An introduction to information graphics and visualization&quot;. By Alberto Cairo.</p>\n</li>\n<li><p>&quot;The Curious Journalist Guide to Data&quot; <a href=\"https://www.gitbook.com/book/towcenter/curious-journalist-s-guide-to-data/details\">(online).</a> By Jonathan Stray.</p>\n</li>\n</ul>\n<p>Other recommended books available at the Research Center:</p>\n<ul>\n<li><p>&quot;Storytelling with Data&quot;. By Cole Nussbaumer Knaflic</p>\n</li>\n<li><p>&quot;Computer-Assisted Research: Information Strategies and Tools for Journalists&quot;. By Nora Paul and Kathleen A. Hansen  </p>\n</li>\n<li><p>&quot;Mapping for Stories: A Computer-Assisted Reporting Guide&quot;. By Jennifer LaFleur and Andy Lehren</p>\n</li>\n<li><p>&quot;The Visual Display of Quantitative Information&quot;. By Edward R. Tufte</p>\n</li>\n<li><p>&quot;Data Points: Visualization That Means Something&quot;. By Nathan Yau  </p>\n</li>\n<li><p>&quot;Design for Information&quot;. By Isabel Meirelles</p>\n</li>\n</ul>\n<p>Instructors will also share tip sheets, stories and tutorials for specific classes.</p>\n<h2>Class Schedule</h2>\n<p>What follows is a <em>tentative</em> schedule. This may change depending on how well you are progressing. If we need more time to work on something or change the order of a lesson plan we will do it and we will update the syllabus. So please be aware of updates from instructors.</p>\n<h3>Week 1 (Feb. 1)</h3>\n<p><strong>Introduction. Researching and finding data.</strong></p>\n<p>Class</p>\n<ol>\n<li>Introductions</li>\n<li>What is data &amp; interactive journalism?</li>\n<li>Syllabus review</li>\n<li>Topics discussion and teams</li>\n<li>Finding data (web and database research) and creating original datasets, with Barbara Gray. <a href=\"http://bit.ly/research1_gray\">http://bit.ly/research1_gray</a></li>\n</ol>\n<p>Homework:</p>\n<p>Background report on assigned Topic Beat of the Trump Administration and write a Reporting Memo</p>\n<p>Read Chapter 1 &quot;Data Journalism: What Computer-Assisted Reporting is and Why Journalists Use it&quot;. Pages 3 &#x2013; 18. And chapter 2 &#x201C;Online Resources: Researching and Finding Data Online&#x201D;. Pages 19 &#x2013; 44. From &#x201C;Computer-Assisted Reporting: A Practical Guide&#x201D; by Brant Houston.</p>\n<h3>Week 2 (Feb. 8)</h3>\n<p><strong>Backgrounding people and organizations, planning and pitching investigations.</strong></p>\n<p>Class</p>\n<ol>\n<li>Backgrounding people and organizations. <a href=\"http://bit.ly/devosarticles\">http://bit.ly/devosarticles</a></li>\n<li>Review of team research, group feedback (5 minutes each).</li>\n<li>The Pitch (examples and requirements)</li>\n<li>How to plan and do a Data Driven Investigation. <a href=\"http://bit.ly/howtoinvestigateandpitch\">http://bit.ly/howtoinvestigateandpitch</a></li>\n</ol>\n<p>Homework:\nEach team prepares their Pitch of 4 Story Ideas and hands it in before next class.\nRead Chapter 3 &quot;Spreadsheets, Part 1: Basic Math for Journalists&quot;. Pages 46 &#x2013; 67.\nRead Chapter 1:\n &#x201C;What&#x2019;s a Number?&#x201D; Pages 1 - 10 from &#x201C;Numbers in the Newsroom:\n Using math and statistics in News&#x201D;, by Sarah Cohen\n.</p>\n<p>###NO class, Monday schedule (Feb. 15)</p>\n<h3>Week 3 (Feb, 22)</h3>\n<p><strong>Math and Statistical Methods for Reporting 1.</strong></p>\n<p>Class</p>\n<ol>\n<li>Pitch presentations (10 minutes each). Editors Ryan and Miguel give feedback and choose the 2 stories to work on during the semester.</li>\n<li>Basic numeracy: Concepts like mean and median (and proper use of each).</li>\n<li>Basic roadmap for evaluating statistics in reports or scientific studies.  </li>\n<li>Math for Journalists using Excel: Sums, differences, percent change, sorting. Hands on class work.</li>\n</ol>\n<p>Homework:\nStatistics Exercise 1\nStory 1 reporting memo 1\nRead Chapter 4 &quot;Spreadsheets, Part 2: More Math that Matters&quot;. Pages 69 &#x2013; 94. From &#x201C;Computer-Assisted Reporting: A Practical Guide&#x201D; by Brant Houston.\nRead Chapter 2: &#x201C;A Newsroom math guide&#x201D;. Pages 11 &#x2013; 60 from &#x201C;Numbers in the Newsroom:\nUsing math and statistics in News&#x201D;, by Sarah Cohen\n.</p>\n<h3>Week 4 (March 1)</h3>\n<p><strong>Math and Statistical Methods for Reporting 2.</strong></p>\n<p>Class</p>\n<ol>\n<li>Brief reporting memo feedback and homework debate</li>\n<li>Math for Journalists using Excel: Review last week, Rates, Ranking, Ratios, Filtering, Pivot Tables, Adjusting for Inflation, String functions.</li>\n</ol>\n<p>Homework\nStory 1 reporting memo 2\nStatistics Exercise 2\n<a href=\"https://github.com/miguelpaz/install-SQLite\">Install SQLite</a> and read <a href=\"https://github.com/miguelpaz/SQL-Tutorial\">Part 1 of this tutorial</a></p>\n<h3>Week 5 (March 8)</h3>\n<p><strong>Data and Database Managers 1: Interviewing Data.</strong></p>\n<p>Class</p>\n<ol>\n<li>Brief reporting memo feedback and homework debate</li>\n<li>What&#x2019;s a Database Manager</li>\n<li>Introduction to SQL and the use of SQLite for data analysis and reporting: Queries, Sorting, Grouping, Filter.</li>\n</ol>\n<p>Homework:\nStory 1 Draft\nSQL exercise 1\nUseful tutorials:\n<a href=\"https://github.com/lazierthanthou/sqlite-manager/wiki/Common-Tasks\">SQLite Wiki</a>\n<a href=\"https://www.w3schools.com/sql/sql_intro.asp\">SQL Intro</a>\n<a href=\"https://www.youtube.com/watch?v=k5OqwUahocc\">Six min. Video tutorial to create a SQLite database</a>(don&apos;t pay attention to the last part)</p>\n<h3>Week 6 (March 15)</h3>\n<p><strong>Data and Database Managers 2: Interviewing and creating Databases</strong></p>\n<p>Class</p>\n<ol>\n<li>Interviewing Data with SQL &amp; SQLite</li>\n<li>Creating your database and reporting on it to find newsworthy threads to follow.</li>\n<li>Newsroom work: review each team&#x2019;s Story 1 Draft and require improvements to be done for handing in the Final version.</li>\n</ol>\n<p>Homework\nStory 1 Final Version\nSQL exercise 2</p>\n<h3>Week 7 (March 22)</h3>\n<p><strong>Math and Statistical Methods for Reporting 3: SPSS</strong></p>\n<p>Class</p>\n<ol>\n<li>Math and Statistical Methods for Reporting using SPSS.</li>\n<li>Why use statistical software? The data ladder. Frequencies. Ranks and quartiles. Manipulating variables.</li>\n<li>Newsroom work: review of each teams Story 1 Final. <strong>Teams decide if they go with Story 2 or will propose another Story idea.</strong></li>\n</ol>\n<p>Homework:\nStory 2 Reporting Memo 1 (or Pitch for New Story 2 if it&#x2019;s the case)\nStatistics Exercise 3</p>\n<h3>Week 8 (March 29)</h3>\n<p><strong>Math and Statistical Methods for Reporting 4: SPSS.</strong></p>\n<p>Class\nMath and Statistical Methods for Reporting 4. SPSS.</p>\n<ol>\n<li>Crosstabs, ANOVA. Indexes (USA Today diversity index). Intro to linear regression.</li>\n<li>Brief reporting memo feedback</li>\n</ol>\n<p>Homework:\nStory 2 Reporting Memo 2\nStatistics exercise 4\nDownload <a href=\"http://openrefine.org/download.html\">Open Refine</a>, <a href=\"http://tabula.technology/\">Tabula</a>, <a href=\"https://chrome.google.com/webstore/detail/scraper/mbigbapnjcgaffohmbkdlecaccepngjd?hl=en\">Scraper</a>, sign up for <a href=\"https://www.import.io/\">Import.io</a></p>\n<h3>Week 9 (April 5)</h3>\n<p><strong>Extracting and Cleaning Data: Open Refine, Tabula &amp; PDF extractors, Basic Scraping.</strong></p>\n<p>Class</p>\n<ol>\n<li>Brief reporting memo feedback</li>\n<li>Extracting and Cleaning Data: Open Refine, Tabula &amp; PDF extractors, Basic Scraping.</li>\n</ol>\n<p>Homework\nStory 2 Reporting Memo 3\nCleaning and extracting data exercise</p>\n<h3>SPRINGBREAK. NO CLASS. April 12.</h3>\n<h3>Week 10 (April 19)</h3>\n<p><strong>Extracting and Cleaning Data: Open Refine, Tabula &amp; PDF extractors, Basic Scraping.</strong></p>\n<p>Class</p>\n<ol>\n<li>Brief reporting memo feedback</li>\n<li>Extracting and Cleaning Data: Open Refine, Tabula &amp; PDF extractors, Basic Scraping.</li>\n</ol>\n<p>Homework\nStory 2 Draft 1\nDocuments extraction exercise\nWatch video <a href=\"https://www.youtube.com/watch?v=P_2qCZGj430\">Getting started analyzing Panama Papers with Neo4j</a></p>\n<p>Read <a href=\"https://neo4j.com/blog/buzzfeed-trumpworld-dataset-neo4j/\">Analyzing Buzzfeed&#x2019;s TrumpWorld Dataset with Neo4J</a></p>\n<h3>Week 11 (April 26)</h3>\n<p><strong>Charting and network graph analysis tools. Who is connected to whom?</strong></p>\n<p>Class</p>\n<ol>\n<li>Story 2 Draft 1 feedback</li>\n<li>Charting tools for data analysis</li>\n<li>Tools for doing networks analysis.</li>\n<li><strong>To be confirmed (guest speakers):</strong> Hands on introduction to Neo4J and it&#x2019;s Cypher queries with either <a href=\"https://offshoreleaks.icij.org/pages/database\">Panama Papers data</a> (<a href=\"https://cloudfront-files-1.publicintegrity.org/offshoreleaks/neo4j/guide/examples.html\">examples of queries</a>) or <a href=\"https://docs.google.com/spreadsheets/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/edit\">TrumpWorld data</a>.</li>\n</ol>\n<p>Homework\nStory 2 Draft 2\nExercise: Create charts or a simple graph database or network graph visualization with data of your Story 2</p>\n<h3>Week 12 (May 3)</h3>\n<p><strong>GeoSpatial Analysis. Principles and practices 1. ArcView.</strong></p>\n<p>Class</p>\n<ol>\n<li>GeoSpatial Analysis. Principles and practices. ArcView.</li>\n<li>Newsroom work: review each team&#x2019;s Story 2 Draft and require improvements to be done for handing in the Final version.</li>\n</ol>\n<p>Homework\nStory 2 Final\nGeoSpatial Analysis Exercise</p>\n<h3>Week 13 (May 10)</h3>\n<p><strong>GeoSpatial Analysis. Principles and practices 2. ArcView.</strong></p>\n<p>Class</p>\n<ol>\n<li>GeoSpatial Analysis. Principles and practices. ArcView.</li>\n<li>Newsroom work: review of each teams Story 2 Final.</li>\n<li>Teams brainstorm and plan how to present and publish the final story 2 in the web.</li>\n</ol>\n<p>Homework\nAuthor web pages of stories and include interactive elements</p>\n<h3>Week 14 (May 17)</h3>\n<p><strong>Hands on newsroom work.</strong></p>\n<p>Class</p>\n<ol>\n<li>Hands on web page work for stories.</li>\n</ol>\n<h3>Week 15 (May 24)</h3>\n<p><strong>Demo day</strong>\nClass\nDemos\nCourse evals\nWrap up</p>\n<h2>Coaches</h2>\n<p>Check <a href=\"http://www.journalism.cuny.edu/current-students/coaching-hours-fall-2015/\">coaching hours in the School website</a>..\nRelated to our class.</p>\n<table>\n  <tr>\n    <td>Name</td>\n    <td>Coaching areas</td>\n    <td>Hours</td>\n    <td>Office Location</td>\n    <td>Email</td>\n  </tr>\n  <tr>\n    <td>Kirsti Itameri</td>\n    <td>Interactive Journalism: Design, WordPress, Illustrator, Photoshop, Social Media</td>\n    <td>Tuesdays 6:30-8:30 pm or by appointment</td>\n    <td>Newsroom</td>\n    <td>kirsti.itameri@journalism.cuny.edu</td>\n  </tr>\n  <tr>\n    <td>TC McCarthy</td>\n    <td>Interactive Journalism: Coding</td>\n    <td>Thursday 6-8 pm</td>\n    <td>Newsroom</td>\n    <td>tc.mccarthy@journalism.cuny.edu</td>\n  </tr>\n  <tr>\n    <td>Malik Singleton</td>\n    <td>Interactive Journalism: Data Storytelling, WordPress, HTML, CSS</td>\n    <td>Mondays and Thursdays, 5:30-7:30 pm</td>\n    <td>Newsroom</td>\n    <td>malik.singleton@journalism.cuny.edu</td>\n  </tr>\n  <tr>\n    <td>Nicholas Wells</td>\n    <td>Interactive Journalism: Data Storytelling, HTML, CSS, R</td>\n    <td>Tuesdays 6:00 - 8:30 pm</td>\n    <td>Newsroom</td>\n    <td>Nicholasbwells@gmail.com</td>\n  </tr>\n</table>\n"
    },
    {
      "component": "footer",
      "links": [
        {
          "href": "https://github.com/datajournalists/djspring17",
          "text": "GitHub"
        },
        {
          "href": "https://github.com/datajournalists",
          "text": "datajournalists"
        }
      ]
    }
  ]
}